Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Or the path to a file containing the Python dictionary:
sv: Eller sÃ¶kvÃ¤gen till en fil som innehÃ¥ller Python-ordlistan:

source: Configures :ref:`vcs-github` by changing :setting:`GITHUB_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-github` genom att Ã¤ndra :setting:`GITHUB_CREDENTIALS`.

source: :ref:`Configuring code hosting credentials in Docker <docker-vcs-config>`
sv: :ref:`Konfigurera inloggningsuppgifter fÃ¶r kodhosting i Docker <docker-vcs-config>`

source: Configures :ref:`vcs-gitlab` by changing :setting:`GITLAB_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-gitlab` genom att Ã¤ndra :setting:`GITLAB_CREDENTIALS`.

source: Configures :ref:`vcs-gitea` by changing :setting:`GITEA_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-gitea` genom att Ã¤ndra :setting:`GITEA_CREDENTIALS`.

source: Configures :ref:`vcs-pagure` by changing :setting:`PAGURE_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-pagure` genom att Ã¤ndra :setting:`PAGURE_CREDENTIALS`.

source: Configures :ref:`vcs-bitbucket-data-center` by changing :setting:`BITBUCKETSERVER_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-bitbucket-data-center` genom att Ã¤ndra :setting:`BITBUCKETSERVER_CREDENTIALS`.

source: Configures :ref:`vcs-bitbucket-cloud` by changing :setting:`BITBUCKETCLOUD_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-bitbucket-cloud` genom att Ã¤ndra :setting:`BITBUCKETCLOUD_CREDENTIALS`.

source: Configures :ref:`vcs-azure-devops` by changing :setting:`AZURE_DEVOPS_CREDENTIALS`.
sv: Konfigurerar :ref:`vcs-azure-devops` genom att Ã¤ndra :setting:`AZURE_DEVOPS_CREDENTIALS`.

source: Automatic suggestion settings
sv: InstÃ¤llningar fÃ¶r automatiska fÃ¶rslag

source: Automatic suggestion services are now configured in the user interface, see :ref:`machine-translation-setup`.
sv: Automatiska fÃ¶rslagstjÃ¤nster konfigureras nu i anvÃ¤ndargrÃ¤nssnittet, se :ref:`machine-translation-setup`.

source: The existing environment variables are imported during the migration to Weblate 4.13, but changing them will not have any further effect.
sv: De befintliga miljÃ¶variablerna importeras under migreringen till Weblate 4.13, men att Ã¤ndra dem kommer inte att ha nÃ¥gon ytterligare effekt.

source: Authentication settings
sv: AutentiseringsinstÃ¤llningar

source: The e-mail based authentication is turned on unless disabled by :envvar:`WEBLATE_NO_EMAIL_AUTH`.
sv: E-postbaserad autentisering Ã¤r aktiverad om den inte inaktiveras av :envvar:`WEBLATE_NO_EMAIL_AUTH`.

source: LDAP authentication configuration.
sv: LDAP-autentiseringskonfiguration.

source: **Example for direct bind:**
sv: **Exempel pÃ¥ direktbindning:**

source: **Example for search and bind:**
sv: **Exempel pÃ¥ sÃ¶kning och bindning:**

source: **Example for union search and bind:**
sv: **Exempel pÃ¥ unionssÃ¶kning och bindning:**

source: **Example with search and bind against Active Directory:**
sv: **Exempel med sÃ¶kning och bindning mot Active Directory:**

source: Enables :ref:`github_auth`.
sv: Aktiverar :ref:`github_auth`.

source: Enables :ref:`github_ee_auth`.
sv: Aktiverar :ref:`github_ee_auth`.

source: Enables :ref:`bitbucket_auth`.
sv: Aktiverar :ref:`bitbucket_auth`.

source: Enables :ref:`facebook_auth`.
sv: Aktiverar :ref:`facebook_auth`.

source: Enables :ref:`google_auth`.
sv: Aktiverar :ref:`google_auth`.

source: Enables :ref:`gitlab_auth`.
sv: Aktiverar :ref:`gitlab_auth`.

source: Enables Gitea authentication.
sv: Aktiverar Gitea-autentisering.

source: Enables Azure Active Directory authentication, see :ref:`azure-auth`.
sv: Aktiverar Azure Active Directory-autentisering, se :ref:`azure-auth`.

source: Azure Active Directory with Tenant support
sv: Azure Active Directory med stÃ¶d fÃ¶r hyresgÃ¤ster

source: Enables Azure Active Directory authentication with Tenant support, see :ref:`azure-auth`.
sv: Aktiverar Azure Active Directory-autentisering med stÃ¶d fÃ¶r Tenant, se :ref:`azure-auth`.

source: Enables Keycloak authentication, see :doc:`psa:backends/keycloak`.
sv: Aktiverar Keycloak-autentisering, se :doc:`psa:backends/keycloak`.

source: When Keycloak is configured to abstract third-party IDP, you will need to configure :envvar:`WEBLATE_CSP_FORM_SRC` for the third-party IDP domain.
sv: NÃ¤r Keycloak Ã¤r konfigurerat fÃ¶r att abstrahera tredjeparts-IDP mÃ¥ste du konfigurera :envvar:`WEBLATE_CSP_FORM_SRC` fÃ¶r tredjeparts-IDP-domÃ¤nen.

source: Example when Keycloak is passing authentication to Microsoft.
sv: Exempel nÃ¤r Keycloak vidarebefordrar autentisering till Microsoft.

source: Linux vendors
sv: Linux-leverantÃ¶rer

source: You can enable authentication using Linux vendors authentication services by setting following variables to any value.
sv: Du kan aktivera autentisering med hjÃ¤lp av Linux-leverantÃ¶rers autentiseringstjÃ¤nster genom att stÃ¤lla in fÃ¶ljande variabler till valfritt vÃ¤rde.

source: Enables Slack authentication, see :ref:`slack-auth`.
sv: Aktiverar Slack-autentisering, se :ref:`slack-auth`.

source: Configures generic OpenID Connect integration.
sv: Konfigurerar generisk OpenID Connect-integration.

source: Configures Fedora OpenID Connect integration.
sv: Konfigurerar Fedora OpenID Connect-integration.

source: Self-signed SAML keys are automatically generated on first container startup. In case you want to use own keys, place the certificate and private key in :file:`/app/data/ssl/saml.crt` and :file:`/app/data/ssl/saml.key`.
sv: SjÃ¤lvsignerade SAML-nycklar genereras automatiskt vid fÃ¶rsta start av containern. Om du vill anvÃ¤nda egna nycklar placerar du certifikatet och den privata nyckeln i :file:`/app/data/ssl/saml.crt` och :file:`/app/data/ssl/saml.key`.

source: SAML Identity Provider settings, see :ref:`saml-auth`.
sv: InstÃ¤llningar fÃ¶r SAML-identitetsleverantÃ¶r, se :ref:`saml-auth`.

source: SAML attributes mapping.
sv: SAML-attributmappning.

source: Other authentication settings
sv: Ãvriga autentiseringsinstÃ¤llningar

source: Disables e-mail authentication when set to any value. See :ref:`disable-email-auth`.
sv: Inaktiverar e-postautentisering nÃ¤r den Ã¤r instÃ¤lld pÃ¥ nÃ¥got vÃ¤rde. Se :ref:`disable-email-auth`.

source: Minimal password score as evaluated by the `zxcvbn <https://github.com/dwolfhub/zxcvbn-python>`_ password strength estimator. Defaults to 3, set to 0 to disable strength checking.
sv: Minsta lÃ¶senordspoÃ¤ng enligt bedÃ¶mningen av lÃ¶senordsstyrkan med `zxcvbn <https://github.com/dwolfhub/zxcvbn-python>`_. StandardvÃ¤rdet Ã¤r 3. StÃ¤ll in pÃ¥ 0 fÃ¶r att inaktivera styrkekontrollen.

source: PostgreSQL database setup
sv: InstÃ¤llning av PostgreSQL-databas

source: The database is created by :file:`docker-compose.yml`, so these settings affect both Weblate and PostgreSQL containers.
sv: Databasen skapas av :file:`docker-compose.yml`, sÃ¥ dessa instÃ¤llningar pÃ¥verkar bÃ¥de Weblate- och PostgreSQL-containrar.

source: PostgreSQL password.
sv: PostgreSQL-lÃ¶senord.

source: PostgreSQL username.
sv: PostgreSQL-anvÃ¤ndarnamn.

source: PostgreSQL database name.
sv: PostgreSQL-databasnamn.

source: PostgreSQL server hostname or IP address. Defaults to ``database``.
sv: PostgreSQL-serverns vÃ¤rdnamn eller IP-adress. StandardvÃ¤rdet Ã¤r ``database``.

source: PostgreSQL server port. Defaults to none (uses the default value).
sv: PostgreSQL-serverport. StandardinstÃ¤llningen Ã¤r ingen (anvÃ¤nder standardvÃ¤rdet).

source: Configure how PostgreSQL handles SSL in connection to the server, for possible choices see `SSL Mode Descriptions <https://www.postgresql.org/docs/11/libpq-ssl.html#LIBPQ-SSL-SSLMODE-STATEMENTS>`_.
sv: Konfigurera hur PostgreSQL hanterar SSL vid anslutning till servern. FÃ¶r mÃ¶jliga alternativ, se `SSL Mode Descriptions <https://www.postgresql.org/docs/11/libpq-ssl.html#LIBPQ-SSL-SSLMODE-STATEMENTS>`_.

source: Configures name of the PostgreSQL role to alter during the database migration, see :ref:`config-postgresql`.
sv: Konfigurerar namnet pÃ¥ PostgreSQL-rollen som ska Ã¤ndras under databasmigreringen, se :ref:`config-postgresql`.

source: Defaults to :envvar:`POSTGRES_USER`.
sv: StandardvÃ¤rdet Ã¤r :envvar:`POSTGRES_USER`.

source: The lifetime of a database connection, as an integer of seconds. Use 0 to close database connections at the end of each request.
sv: LivslÃ¤ngden fÃ¶r en databasanslutning, uttryckt som ett heltal i sekunder. AnvÃ¤nd 0 fÃ¶r att stÃ¤nga databasanslutningar i slutet av varje begÃ¤ran.

source: The default behavior is to have unlimited persistent database connections.
sv: StandardinstÃ¤llningen Ã¤r att ha obegrÃ¤nsade permanenta databasanslutningar.

source: Enabling connection persistence will typically, cause more open connection to the database. Please adjust your database configuration prior enabling.
sv: Om du aktiverar anslutningspersistens kommer det vanligtvis att leda till fler Ã¶ppna anslutningar till databasen. Justera din databaskonfiguration innan du aktiverar funktionen.

source: Disable server side cursors in the database. This is necessary in some :command:`pgbouncer` setups.
sv: Inaktivera server-sidans markÃ¶rer i databasen. Detta Ã¤r nÃ¶dvÃ¤ndigt i vissa :command:`pgbouncer`-konfigurationer.

source: Set to false to disables environment based configuration of the database connection. Use :ref:`docker-settings-override` to configure the database connection manually.
sv: StÃ¤ll in pÃ¥ false fÃ¶r att inaktivera miljÃ¶baserad konfiguration av databasanslutningen. AnvÃ¤nd :ref:`docker-settings-override` fÃ¶r att konfigurera databasanslutningen manuellt.

source: MySQL or MariaDB server
sv: MySQL- eller MariaDB-server

source: Neither MySQL nor MariaDB can not be configured via environment variables. See :ref:`mysql` for info on using those with Weblate. Use :envvar:`WEBLATE_DATABASES` to configure the database connection manually.
sv: Varken MySQL eller MariaDB kan konfigureras via miljÃ¶variabler. Se :ref:`mysql` fÃ¶r information om hur du anvÃ¤nder dessa med Weblate. AnvÃ¤nd :envvar:`WEBLATE_DATABASES` fÃ¶r att konfigurera databasanslutningen manuellt.

source: Database backup settings
sv: InstÃ¤llningar fÃ¶r databasbackup

source: Configures the daily database dump using :setting:`DATABASE_BACKUP`. Defaults to ``plain``.
sv: Konfigurerar den dagliga databasdumpen med hjÃ¤lp av :setting:`DATABASE_BACKUP`. StandardinstÃ¤llningen Ã¤r ``plain``.

source: Datastore server setup
sv: Datastore-serverkonfiguration

source: Using Valkey or Redis is required by the Weblate container and you have to provide a connection parameters when running Weblate in Docker.
sv: Weblate-containern krÃ¤ver att Valkey eller Redis anvÃ¤nds, och du mÃ¥ste ange anslutningsparametrar nÃ¤r du kÃ¶r Weblate i Docker.

source: The datastore server hostname or IP address. Defaults to ``cache``.
sv: Datastore-serverns vÃ¤rdnamn eller IP-adress. StandardvÃ¤rdet Ã¤r ``cache``.

source: The datastore server port. Defaults to ``6379``.
sv: Datastore-serverns port. StandardvÃ¤rdet Ã¤r ``6379``.

source: The datastore database number, defaults to ``1``.
sv: Datastore-databasnumret, standardvÃ¤rdet Ã¤r ``1``.

source: The datastore database user, not used by default.
sv: Datastore-databasens anvÃ¤ndare, anvÃ¤nds inte som standard.

source: The datastore server password, not used by default.
sv: Datastore-serverns lÃ¶senord, anvÃ¤nds inte som standard.

source: Enables using SSL for the datastore connection.
sv: Aktiverar anvÃ¤ndning av SSL fÃ¶r datalagringsanslutningen.

source: Can be used to disable SSL certificate verification for the datastore connection.
sv: Kan anvÃ¤ndas fÃ¶r att inaktivera SSL-certifikatverifiering fÃ¶r datalagringsanslutningen.

source: Email server setup
sv: Konfigurera e-postserver

source: To make outgoing e-mail work, you need to provide a mail server.
sv: FÃ¶r att utgÃ¥ende e-post ska fungera mÃ¥ste du ange en e-postserver.

source: Example TLS configuration:
sv: Exempel pÃ¥ TLS-konfiguration:

source: Example SSL configuration:
sv: Exempel pÃ¥ SSL-konfiguration:

source: Mail server hostname or IP address.
sv: E-postserverns vÃ¤rdnamn eller IP-adress.

source: Mail server port, defaults to 25.
sv: E-postserverns port, standardinstÃ¤llningen Ã¤r 25.

source: E-mail authentication user.
sv: E-postautentiseringsanvÃ¤ndare.

source: E-mail authentication password.
sv: E-postautentiseringslÃ¶senord.

source: Whether to use an implicit TLS (secure) connection when talking to the SMTP server. In most e-mail documentation, this type of TLS connection is referred to as SSL. It is generally used on port 465. If you are experiencing problems, see the explicit TLS setting :envvar:`WEBLATE_EMAIL_USE_TLS`.
sv: Om en implicit TLS-anslutning (sÃ¤ker) ska anvÃ¤ndas vid kommunikation med SMTP-servern. I de flesta e-postdokumentationer kallas denna typ av TLS-anslutning fÃ¶r SSL. Den anvÃ¤nds vanligtvis pÃ¥ port 465. Om du har problem, se den explicita TLS-instÃ¤llningen :envvar:`WEBLATE_EMAIL_USE_TLS`.

source: The SSL/TLS support is automatically enabled based on the :envvar:`WEBLATE_EMAIL_PORT`.
sv: SSL/TLS-stÃ¶det aktiveras automatiskt baserat pÃ¥ :envvar:`WEBLATE_EMAIL_PORT`.

source: Whether to use a TLS (secure) connection when talking to the SMTP server. This is used for explicit TLS connections, generally on port 587 or 25. If you are experiencing connections that hang, see the implicit TLS setting :envvar:`WEBLATE_EMAIL_USE_SSL`.
sv: Om en TLS-anslutning (sÃ¤ker) ska anvÃ¤ndas vid kommunikation med SMTP-servern. Detta anvÃ¤nds fÃ¶r explicita TLS-anslutningar, vanligtvis pÃ¥ port 587 eller 25. Om du upplever att anslutningarna hÃ¤nger sig, se den implicita TLS-instÃ¤llningen :envvar:`WEBLATE_EMAIL_USE_SSL`.

source: Configures Django back-end to use for sending e-mails.
sv: Konfigurerar Django-backend fÃ¶r att skicka e-post.

source: Configures if and how Weblate should update repositories.
sv: Konfigurerar om och hur Weblate ska uppdatera arkiv.

source: This is a Boolean setting (use ``"true"`` or ``"false"``).
sv: Detta Ã¤r en boolesk instÃ¤llning (anvÃ¤nd ``"true"`` eller ``"false"``).

source: Site integration
sv: Webbplatsintegration

source: Configures :setting:`GET_HELP_URL`.
sv: Konfigurerar :setting:`GET_HELP_URL`.

source: Configures :setting:`STATUS_URL`.
sv: Konfigurerar :setting:`STATUS_URL`.

source: Configures :setting:`LEGAL_URL`.
sv: Konfigurerar :setting:`LEGAL_URL`.

source: Configures :setting:`PRIVACY_URL`.
sv: Konfigurerar :setting:`PRIVACY_URL`.

source: It is recommended to collect errors from the installation systematically, see :ref:`collecting-errors`.
sv: Det rekommenderas att systematiskt samla in fel frÃ¥n installationen, se :ref:`collecting-errors`.

source: To enable support for Rollbar, set the following:
sv: FÃ¶r att aktivera stÃ¶d fÃ¶r Rollbar, stÃ¤ll in fÃ¶ljande:

source: Your Rollbar post server access token.
sv: Din Rollbar-postserverÃ¥tkomsttoken.

source: Your Rollbar environment, defaults to ``production``.
sv: Din Rollbar-miljÃ¶ Ã¤r som standard instÃ¤lld pÃ¥ ``produktion``.

source: To enable support for Sentry, set following:
sv: FÃ¶r att aktivera stÃ¶d fÃ¶r Sentry, stÃ¤ll in fÃ¶ljande:

source: Your Sentry DSN, see :setting:`SENTRY_DSN`.
sv: Din Sentry DSN, se :setting:`SENTRY_DSN`.

source: Your Sentry Environment (optional), defaults to :envvar:`WEBLATE_SITE_DOMAIN`.
sv: Din Sentry-miljÃ¶ (valfritt), standardinstÃ¤llning Ã¤r :envvar:`WEBLATE_SITE_DOMAIN`.

source: Whether to monitor Celery Beat tasks with Sentry, defaults to ``True``.
sv: Om Celery Beat-uppgifter ska Ã¶vervakas med Sentry, standardinstÃ¤llningen Ã¤r ``True``.

source: Configures :setting:`SENTRY_TRACES_SAMPLE_RATE`.
sv: Konfigurerar :setting:`SENTRY_TRACES_SAMPLE_RATE`.

source: Configures :setting:`SENTRY_PROFILES_SAMPLE_RATE`.
sv: Konfigurerar :setting:`SENTRY_PROFILES_SAMPLE_RATE`.

source: Configures :setting:`SENTRY_SEND_PII`.
sv: Konfigurerar :setting:`SENTRY_SEND_PII`.

source: Localization CDN
sv: Lokalisering CDN

source: Configuration for :ref:`addon-weblate.cdn.cdnjs`.
sv: Konfiguration fÃ¶r :ref:`addon-weblate.cdn.cdnjs`.

source: The :envvar:`WEBLATE_LOCALIZE_CDN_PATH` is path within the container. It should be stored on the persistent volume and not in the transient storage.
sv: :envvar:`WEBLATE_LOCALIZE_CDN_PATH` Ã¤r en sÃ¶kvÃ¤g inom containern. Den bÃ¶r lagras pÃ¥ den permanenta volymen och inte i det tillfÃ¤lliga lagringsutrymmet.

source: One of possibilities is storing that inside the Weblate data dir:
sv: En mÃ¶jlighet Ã¤r att lagra det i Weblate-datakatalogen:

source: You are responsible for setting up serving of the files generated by Weblate, it only does stores the files in configured location.
sv: Du ansvarar fÃ¶r att konfigurera serveringen av de filer som genereras av Weblate, som endast lagrar filerna pÃ¥ den konfigurerade platsen.

source: Changing enabled apps, checks, add-ons, machine translation or autofixes
sv: Ãndra aktiverade appar, kontroller, tillÃ¤gg, maskinÃ¶versÃ¤ttning eller automatiska korrigeringar

source: The built-in configuration of enabled checks, add-ons or autofixes can be adjusted by the following variables:
sv: Den inbyggda konfigurationen av aktiverade kontroller, tillÃ¤gg eller automatiska korrigeringar kan justeras med fÃ¶ljande variabler:

source: Container settings
sv: ContainerinstÃ¤llningar

source: Base number of worker processes running in the container. When not set it is determined automatically on container startup based on number of CPU cores available.
sv: Basantalet arbetareprocesser som kÃ¶rs i behÃ¥llaren. Om det inte Ã¤r instÃ¤llt bestÃ¤ms det automatiskt vid behÃ¥llarens start baserat pÃ¥ antalet tillgÃ¤ngliga CPU-kÃ¤rnor.

source: It is used to determine :envvar:`CELERY_MAIN_OPTIONS`, :envvar:`CELERY_NOTIFY_OPTIONS`, :envvar:`CELERY_MEMORY_OPTIONS`, :envvar:`CELERY_TRANSLATE_OPTIONS`, :envvar:`CELERY_BACKUP_OPTIONS`, :envvar:`CELERY_BEAT_OPTIONS`, and :envvar:`WEB_WORKERS`. You can use these settings to fine-tune.
sv: Den anvÃ¤nds fÃ¶r att bestÃ¤mma :envvar:`CELERY_MAIN_OPTIONS`, :envvar:`CELERY_NOTIFY_OPTIONS`, :envvar:`CELERY_MEMORY_OPTIONS`, :envvar:`CELERY_TRANSLATE_OPTIONS`, :envvar:`CELERY_BACKUP_OPTIONS`, :envvar:`CELERY_BEAT_OPTIONS` och :envvar:`WEB_WORKERS`. Du kan anvÃ¤nda dessa instÃ¤llningar fÃ¶r att finjustera.

source: These variables allow you to adjust Celery worker options. It can be useful to adjust concurrency (``--concurrency 16``) or use different pool implementation (``--pool=gevent``).
sv: Med dessa variabler kan du justera Celery-arbetaralternativen. Det kan vara anvÃ¤ndbart att justera samtidigheten (``--concurrency 16``) eller anvÃ¤nda en annan poolimplementering (``--pool=gevent``).

source: By default, the number of concurrent workers is based on :envvar:`WEBLATE_WORKERS`.
sv: Som standard baseras antalet samtidiga arbetare pÃ¥ :envvar:`WEBLATE_WORKERS`.

source: :doc:`Celery worker options <celery:reference/celery.bin.worker>`
sv: :doc:`Celery-arbetaralternativ <celery:reference/celery.bin.worker>`

source: This variable can be set to ``1`` to run only one celery process. This reduces memory usage but may impact Weblate performance.
sv: Denna variabel kan stÃ¤llas in pÃ¥ ``1`` fÃ¶r att endast kÃ¶ra en celery-process. Detta minskar minnesanvÃ¤ndningen men kan pÃ¥verka Weblates prestanda.

source: Configure how many WSGI workers should be executed.
sv: Konfigurera hur mÃ¥nga WSGI-arbetare som ska kÃ¶ras.

source: It defaults to half of :envvar:`WEBLATE_WORKERS`, but is always at least 2.
sv: StandardvÃ¤rdet Ã¤r hÃ¤lften av :envvar:`WEBLATE_WORKERS`, men Ã¤r alltid minst 2.

source: :envvar:`WEB_WORKERS` configures how many worker processes will used by :program:`granian`.
sv: :envvar:`WEB_WORKERS` konfigurerar hur mÃ¥nga arbetsprocesser som ska anvÃ¤ndas av :program:`granian`.

source: Defines which services should be executed inside the container. Use this for :ref:`docker-scaling`.
sv: Definierar vilka tjÃ¤nster som ska kÃ¶ras inuti containern. AnvÃ¤nd detta fÃ¶r :ref:`docker-scaling`.

source: Following services are defined:
sv: FÃ¶ljande tjÃ¤nster definieras:

source: Celery task scheduler, only one instance should be running. This container is also responsible for the database structure migrations and it should be started prior others.
sv: Celery-uppgiftsschemalÃ¤ggare, endast en instans ska kÃ¶ras. Denna behÃ¥llare ansvarar ocksÃ¥ fÃ¶r migreringar av databasstrukturen och ska startas fÃ¶re andra.

source: Celery worker for backups, only one instance should be running.
sv: Celery-arbetare fÃ¶r sÃ¤kerhetskopior, endast en instans ska kÃ¶ras.

source: Generic Celery worker.
sv: Generisk selleriarbetare.

source: Translation memory Celery worker.
sv: ÃversÃ¤ttningsminne Celery-arbetare.

source: Notifications Celery worker.
sv: Meddelanden Celery-arbetare.

source: Automatic translation Celery worker.
sv: Automatisk Ã¶versÃ¤ttning Selleriarbetare.

source: Web server.
sv: Webbserver.

source: URL of `Anubis`_ server to handle subrequest authentication. This can be useful to filter incoming HTTP requests using proof-of-work to stop AI crawlers. You need to configure `Anubis for Subrequest Authentication`_ to make it work.
sv: URL fÃ¶r `Anubis`_ -servern fÃ¶r att hantera autentisering av underfÃ¶rfrÃ¥gningar. Detta kan vara anvÃ¤ndbart fÃ¶r att filtrera inkommande HTTP-fÃ¶rfrÃ¥gningar med hjÃ¤lp av proof-of-work fÃ¶r att stoppa AI-crawlers. Du mÃ¥ste konfigurera `Anubis fÃ¶r autentisering av underfÃ¶rfrÃ¥gningar`_ fÃ¶r att det ska fungera.

source: Docker container volumes
sv: Docker-containervolymer

source: There are two volumes (:file:`data` and :file:`cache`) exported by the Weblate container.
sv: Det finns tvÃ¥ volymer (:file:`data` och :file:`cache`) som exporteras av Weblate-containern.

source: The other service containers (such as PostgreSQL or Valkey) have their data volumes as well and are required to maintain Weblate persistence.
sv: De andra servicecontainrarna (som PostgreSQL eller Valkey) har ocksÃ¥ sina datavolymer och krÃ¤vs fÃ¶r att upprÃ¤tthÃ¥lla Weblates persistens.

source: The PostgreSQL container stores the database in the :file:`/var/lib/postgresql` volume and Valkey in the :file:`/data` volume. Valkey container does not save the data by default and needs additional configuration to enable persistence.
sv: PostgreSQL-containern lagrar databasen i volymen :file:`/var/lib/postgresql` och Valkey i volymen :file:`/data`. Valkey-containern sparar inte data som standard och krÃ¤ver ytterligare konfiguration fÃ¶r att aktivera persistens.

source: Base your configuration on Weblate-provided examples or consult their documentation for more information.
sv: Basera din konfiguration pÃ¥ exempel frÃ¥n Weblate eller lÃ¤s deras dokumentation fÃ¶r mer information.

source: The :file:`data` volume is mounted as :file:`/app/data` and is used to store Weblate persistent data such as cloned repositories or to customize Weblate installation. :setting:`DATA_DIR` describes in more detail what is stored here.
sv: Volymen :file:`data` Ã¤r monterad som :file:`/app/data` och anvÃ¤nds fÃ¶r att lagra Weblate-data som klonade arkiv eller fÃ¶r att anpassa Weblate-installationen. :setting:`DATA_DIR` beskriver mer detaljerat vad som lagras hÃ¤r.

source: The :file:`data` volume is also place to store Weblate customization such as :ref:`docker-settings-override`, :ref:`docker-static-override` or :ref:`docker-python-override`.
sv: Volymen :file:`data` anvÃ¤nds ocksÃ¥ fÃ¶r att lagra Weblate-anpassningar sÃ¥som :ref:`docker-settings-override`, :ref:`docker-static-override` eller :ref:`docker-python-override`.
